virtualabs/cutcutgo/src/packs/ATSAMDA1J16B_DFP/component/ac.h
#define AC_STATUSA_STATE_Pos                  _U_(0)                                               /**< (AC_STATUSA Position) Comparator x Current State */
#define AC_STATUSA_STATE_Msk                  (_U_(0x3) << AC_STATUSA_STATE_Pos)                   /**< (AC_STATUSA Mask) STATE */
#define AC_STATUSA_STATE(value)               (AC_STATUSA_STATE_Msk & ((value) << AC_STATUSA_STATE_Pos)) 

/* -------- AC_STATUSB : (AC Offset: 0x09) ( R/ 8) Status B -------- */
#define AC_STATUSB_RESETVALUE                 _U_(0x00)                                            /**<  (AC_STATUSB) Status B  Reset Value */

#define AC_STATUSB_READY0_Pos                 _U_(0)                                               /**< (AC_STATUSB) Comparator 0 Ready Position */
#define AC_STATUSB_READY0_Msk                 (_U_(0x1) << AC_STATUSB_READY0_Pos)                  /**< (AC_STATUSB) Comparator 0 Ready Mask */
#define AC_STATUSB_READY0(value)              (AC_STATUSB_READY0_Msk & ((value) << AC_STATUSB_READY0_Pos))
#define AC_STATUSB_READY1_Pos                 _U_(1)                                               /**< (AC_STATUSB) Comparator 1 Ready Position */
#define AC_STATUSB_READY1_Msk                 (_U_(0x1) << AC_STATUSB_READY1_Pos)                  /**< (AC_STATUSB) Comparator 1 Ready Mask */
#define AC_STATUSB_READY1(value)              (AC_STATUSB_READY1_Msk & ((value) << AC_STATUSB_READY1_Pos))
#define AC_STATUSB_SYNCBUSY_Pos               _U_(7)                                               /**< (AC_STATUSB) Synchronization Busy Position */
#define AC_STATUSB_SYNCBUSY_Msk               (_U_(0x1) << AC_STATUSB_SYNCBUSY_Pos)                /**< (AC_STATUSB) Synchronization Busy Mask */
#define AC_STATUSB_SYNCBUSY(value)            (AC_STATUSB_SYNCBUSY_Msk & ((value) << AC_STATUSB_SYNCBUSY_Pos))
#define AC_STATUSB_Msk                        _U_(0x83)                                            /**< (AC_STATUSB) Register Mask  */

#define AC_STATUSB_READY_Pos                  _U_(0)                                               /**< (AC_STATUSB Position) Comparator x Ready */
#define AC_STATUSB_READY_Msk                  (_U_(0x3) << AC_STATUSB_READY_Pos)                   /**< (AC_STATUSB Mask) READY */
#define AC_STATUSB_READY(value)               (AC_STATUSB_READY_Msk & ((value) << AC_STATUSB_READY_Pos)) 

/* -------- AC_STATUSC : (AC Offset: 0x0A) ( R/ 8) Status C -------- */
#define AC_STATUSC_RESETVALUE                 _U_(0x00)                                            /**<  (AC_STATUSC) Status C  Reset Value */

#define AC_STATUSC_STATE0_Pos                 _U_(0)                                               /**< (AC_STATUSC) Comparator 0 Current State Position */
#define AC_STATUSC_STATE0_Msk                 (_U_(0x1) << AC_STATUSC_STATE0_Pos)                  /**< (AC_STATUSC) Comparator 0 Current State Mask */
#define AC_STATUSC_STATE0(value)              (AC_STATUSC_STATE0_Msk & ((value) << AC_STATUSC_STATE0_Pos))
#define AC_STATUSC_STATE1_Pos                 _U_(1)                                               /**< (AC_STATUSC) Comparator 1 Current State Position */
#define AC_STATUSC_STATE1_Msk                 (_U_(0x1) << AC_STATUSC_STATE1_Pos)                  /**< (AC_STATUSC) Comparator 1 Current State Mask */
#define AC_STATUSC_STATE1(value)              (AC_STATUSC_STATE1_Msk & ((value) << AC_STATUSC_STATE1_Pos))
#define AC_STATUSC_WSTATE0_Pos                _U_(4)                                               /**< (AC_STATUSC) Window 0 Current State Position */
#define AC_STATUSC_WSTATE0_Msk                (_U_(0x3) << AC_STATUSC_WSTATE0_Pos)                 /**< (AC_STATUSC) Window 0 Current State Mask */
#define AC_STATUSC_WSTATE0(value)             (AC_STATUSC_WSTATE0_Msk & ((value) << AC_STATUSC_WSTATE0_Pos))
#define   AC_STATUSC_WSTATE0_ABOVE_Val        _U_(0x0)                                             /**< (AC_STATUSC) Signal is above window  */
#define   AC_STATUSC_WSTATE0_INSIDE_Val       _U_(0x1)                                             /**< (AC_STATUSC) Signal is inside window  */
#define   AC_STATUSC_WSTATE0_BELOW_Val        _U_(0x2)                                             /**< (AC_STATUSC) Signal is below window  */
#define AC_STATUSC_WSTATE0_ABOVE              (AC_STATUSC_WSTATE0_ABOVE_Val << AC_STATUSC_WSTATE0_Pos) /**< (AC_STATUSC) Signal is above window Position  */
#define AC_STATUSC_WSTATE0_INSIDE             (AC_STATUSC_WSTATE0_INSIDE_Val << AC_STATUSC_WSTATE0_Pos) /**< (AC_STATUSC) Signal is inside window Position  */
#define AC_STATUSC_WSTATE0_BELOW              (AC_STATUSC_WSTATE0_BELOW_Val << AC_STATUSC_WSTATE0_Pos) /**< (AC_STATUSC) Signal is below window Position  */
#define AC_STATUSC_Msk                        _U_(0x33)                                            /**< (AC_STATUSC) Register Mask  */

#define AC_STATUSC_STATE_Pos                  _U_(0)                                               /**< (AC_STATUSC Position) Comparator x Current State */
#define AC_STATUSC_STATE_Msk                  (_U_(0x3) << AC_STATUSC_STATE_Pos)                   /**< (AC_STATUSC Mask) STATE */
#define AC_STATUSC_STATE(value)               (AC_STATUSC_STATE_Msk & ((value) << AC_STATUSC_STATE_Pos)) 

/* -------- AC_WINCTRL : (AC Offset: 0x0C) (R/W 8) Window Control -------- */
#define AC_WINCTRL_RESETVALUE                 _U_(0x00)                                            /**<  (AC_WINCTRL) Window Control  Reset Value */

#define AC_WINCTRL_WEN0_Pos                   _U_(0)                                               /**< (AC_WINCTRL) Window 0 Mode Enable Position */
#define AC_WINCTRL_WEN0_Msk                   (_U_(0x1) << AC_WINCTRL_WEN0_Pos)                    /**< (AC_WINCTRL) Window 0 Mode Enable Mask */
#define AC_WINCTRL_WEN0(value)                (AC_WINCTRL_WEN0_Msk & ((value) << AC_WINCTRL_WEN0_Pos))
#define AC_WINCTRL_WINTSEL0_Pos               _U_(1)                                               /**< (AC_WINCTRL) Window 0 Interrupt Selection Position */
#define AC_WINCTRL_WINTSEL0_Msk               (_U_(0x3) << AC_WINCTRL_WINTSEL0_Pos)                /**< (AC_WINCTRL) Window 0 Interrupt Selection Mask */
#define AC_WINCTRL_WINTSEL0(value)            (AC_WINCTRL_WINTSEL0_Msk & ((value) << AC_WINCTRL_WINTSEL0_Pos))
#define   AC_WINCTRL_WINTSEL0_ABOVE_Val       _U_(0x0)                                             /**< (AC_WINCTRL) Interrupt on signal above window  */
#define   AC_WINCTRL_WINTSEL0_INSIDE_Val      _U_(0x1)                                             /**< (AC_WINCTRL) Interrupt on signal inside window  */
#define   AC_WINCTRL_WINTSEL0_BELOW_Val       _U_(0x2)                                             /**< (AC_WINCTRL) Interrupt on signal below window  */
#define   AC_WINCTRL_WINTSEL0_OUTSIDE_Val     _U_(0x3)                                             /**< (AC_WINCTRL) Interrupt on signal outside window  */
#define AC_WINCTRL_WINTSEL0_ABOVE             (AC_WINCTRL_WINTSEL0_ABOVE_Val << AC_WINCTRL_WINTSEL0_Pos) /**< (AC_WINCTRL) Interrupt on signal above window Position  */
#define AC_WINCTRL_WINTSEL0_INSIDE            (AC_WINCTRL_WINTSEL0_INSIDE_Val << AC_WINCTRL_WINTSEL0_Pos) /**< (AC_WINCTRL) Interrupt on signal inside window Position  */
#define AC_WINCTRL_WINTSEL0_BELOW             (AC_WINCTRL_WINTSEL0_BELOW_Val << AC_WINCTRL_WINTSEL0_Pos) /**< (AC_WINCTRL) Interrupt on signal below window Position  */
#define AC_WINCTRL_WINTSEL0_OUTSIDE           (AC_WINCTRL_WINTSEL0_OUTSIDE_Val << AC_WINCTRL_WINTSEL0_Pos) /**< (AC_WINCTRL) Interrupt on signal outside window Position  */
#define AC_WINCTRL_Msk                        _U_(0x07)                                            /**< (AC_WINCTRL) Register Mask  */

#define AC_WINCTRL_WEN_Pos                    _U_(0)                                               /**< (AC_WINCTRL Position) Window x Mode Enable */
#define AC_WINCTRL_WEN_Msk                    (_U_(0x1) << AC_WINCTRL_WEN_Pos)                     /**< (AC_WINCTRL Mask) WEN */
#define AC_WINCTRL_WEN(value)                 (AC_WINCTRL_WEN_Msk & ((value) << AC_WINCTRL_WEN_Pos)) 

/* -------- AC_COMPCTRL : (AC Offset: 0x10) (R/W 32) Comparator Control n -------- */
#define AC_COMPCTRL_RESETVALUE                _U_(0x00)                                            /**<  (AC_COMPCTRL) Comparator Control n  Reset Value */

